## Read from CSV
**read_csv() method**<br>
By default 1st row will be treated as a header<br>
```  skiprows = number_of_rows_to_skip  ``` if there are extra rows.<br>
```  headers=None  ``` if there are no headers present in the file. Use names=['column1','column2','column3','column4'] to name columns

In [1]:
import pandas as pd
df = pd.read_csv('stocks_data.csv')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [2]:
df = pd.read_csv('stocks_data.csv',skiprows=1)
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [3]:
df = pd.read_csv('stocks_data.csv',nrows=3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [4]:
df = pd.read_csv('stocks_data.csv')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

**NaN** value in pandas signifies as a not available value. In our data it can be represented in many ways ``` n.a. ``` or  ``` Not available ``` or an empty string and for numericals,  maybe values like ``` -1 ``` or any other can be used. These all can be converted to ``` NaN ``` so that they can be generalised by providing parameter na_values = [ list of na values in data ] to read function.<br> See below way to use this to convert muliple<br>

In [5]:
df = pd.read_csv('stocks_data.csv',na_values=['not available','n.a.'])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

To convert only few columns with NaN, like in above case revenue with ``` -1 ``` can be considered as NaN but not eps with value -1, use dictonary with key as column name and value as list of NaN values.<br> See below case for this dictonary way of using na_values

In [6]:
df = pd.read_csv('stocks_data.csv',na_values={
    'eps':['not available','n.a.'],
    'price':['not available','n.a.'],
    'people':['not available','n.a.'],
    'revenue':['not available','n.a.',-1]
})
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

## Writing to file

In [7]:
!ls

data_frame_basics.ipynb            read_write_files_with_pandas.ipynb
new_stocks_data.csv                stocks_data.csv
new_stocks_data_few_columns.csv    weather.csv
new_stocks_data_without_header.csv weather.xlsx
new_stocks_data_without_index.csv

In [8]:
df.to_csv('new_stocks_data.csv')
!ls

data_frame_basics.ipynb            read_write_files_with_pandas.ipynb
new_stocks_data.csv                stocks_data.csv
new_stocks_data_few_columns.csv    weather.csv
new_stocks_data_without_header.csv weather.xlsx
new_stocks_data_without_index.csv

In [9]:
df.to_csv('new_stocks_data_few_columns.csv',columns=['tickers','price'])
!ls

data_frame_basics.ipynb            read_write_files_with_pandas.ipynb
new_stocks_data.csv                stocks_data.csv
new_stocks_data_few_columns.csv    weather.csv
new_stocks_data_without_header.csv weather.xlsx
new_stocks_data_without_index.csv

In [10]:
df.to_csv('new_stocks_data_without_index.csv',index=False)
!ls

data_frame_basics.ipynb            read_write_files_with_pandas.ipynb
new_stocks_data.csv                stocks_data.csv
new_stocks_data_few_columns.csv    weather.csv
new_stocks_data_without_header.csv weather.xlsx
new_stocks_data_without_index.csv

In [11]:
df.to_csv('new_stocks_data_without_header.csv',header=False)
!ls

data_frame_basics.ipynb            read_write_files_with_pandas.ipynb
new_stocks_data.csv                stocks_data.csv
new_stocks_data_few_columns.csv    weather.csv
new_stocks_data_without_header.csv weather.xlsx
new_stocks_data_without_index.csv

## Reading excel
Here you need to mention sheet nmae also.

In [14]:
df = pd.read_excel('stock_data.xlsx','Sheet1')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

You need to mention convertor for these to convert to NaN values.